test/finalsubmit/app/controllers/pstaffs_controller.rb

SELECT `pstaffs`.* FROM `pstaffs` WHERE `pstaffs`.`user_id` = 4
---
  def index
    if(current_user.phase1 == false &&  current_user.phase2 == false && current_user.phase3 == false)
      x= current_user.id
      @user_profile = UserProfile.all.where("user_id = ?",x)
      @user_profile =@user_profile[0]
     #puts(@user_profile[0].department)

      @pstaff = Pstaff.where("user_profile_id = ?",@user_profile.id)

SELECT  `pstaffs`.* FROM `pstaffs` WHERE `pstaffs`.`id` = 1 LIMIT 1
---
    def set_pstaff
      # if(current_user.phase1 == false &&  current_user.phase2 == false && current_user.phase3 == false)
      @pstaff = Pstaff.find(params[:id])