test/finalsubmit/app/views/check/phase2.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  <% @phase =phase %>
  <% @user_profile = UserProfile.find(phase.user_profile_id)%>