test/finalsubmit/app/views/check/phase1.html.erb

<% @phase =phase %>
<% @user_profile = UserProfile.find(phase.user_profile_id)%>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1